mytest.yml
---
execution:
  - concurrency: 10
    hold-for: 1m
    ramp-up: 20s
    scenario: Thread Group
scenarios:
  Thread Group:
    requests:
      - label: myTest
        method: GET
        url: http://bookapp.172.16.44.130.nip.io/
  services:
    - criteria:
        - avg-rt>110ms for 7s, stop as failed
        # - hits of reserve >10 for 13s. continue as failed
      module: passfail
  settings:
    default-executor: jmeter